In [2]:
import pandas as pd

In [3]:
import numpy as np

In [7]:
df = pd.read_csv("Titanic_Dataset.csv")

In [11]:
df1 = df[['Name','Sex','Age']][0:5]

In [12]:
df1

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0